import Title from "@/components/title";
import Tariffs from "@/components/tariffs";
import image1 from "@/public/tariff1.jpg";
import image2 from "@/public/tariff2.jpg";
import image3 from "@/public/tariff3.jpg";
import image4 from "@/public/tariff4.jpg";
import { Button } from "@/components/ui/button";
import TariffListItem from "@/components/tariffListItem";
import ReusableAccordion from "@/components/reusableAccordion";
import TimeCard from "@/components/timeCard";
import bgImg from "@/public/prices-bg.jpg";
import Image from "next/image";


export default function Prices() {
    return (
      <>
        <div className="container mx-auto my-32 px-4 sm:px-6  text-center">
          <Title
            title="Ми допомагаємо розкрити потенціал дитини"
            subtitle="Наша мета - розвинути у дитини життєво важливі навички та любов до шахів."
          />
          <Tariffs
            image={image1}
            title="Початківці"
            level="Початковий рівень"
            text={
              <>
                Знайомство зі світом шахів
                <br />✔ Для дітей з нуля
                <br />✔ 1-2 заняття/тиждень по 60 хвилин
                <br />✔ У групі 6-8 дітей
              </>
            }
            order={1}
          />
          <Tariffs
            image={image2}
            title="Джуніори"
            level="Перед базовий рівень"
            text={
              <>
                Знайомство з грою в шахи
                <br />✔ Прищеплюємо інтерес до гри, знайомимося з особливими
                шаховими ходами, дебюти та мат
                <br />✔ 1-2 заняття/тиждень по 60 хвилин
                <br />✔ У групі 6-8 осіб
              </>
            }
            order={2}
          />
          <Tariffs
            image={image3}
            title="Мідли"
            level="Базовий рівень"
            text={
              <>
                Знайомство з шаховою тактикою
                <br />✔ Для дітей, які вже вміють грати
                <br />✔ Вчимося правильно починати партію, помічати тактичні
                можливості та грамотно ставити мат.
                <br />✔ 1-2 заняття/тиждень по 60 хвилин
                <br />✔ У групі 6-8 осіб
              </>
            }
            order={1}
          />
          <Tariffs
            image={image4}
            title="Сеньйори"
            level="Просунутий рівень"
            text={
              <>
                Знайомство з шаховою стратегією
                <br />✔ Для дітей 11-17 років, які брали участь у змаганнях
                <br />✔ 1-2 заняття на тиждень по 60 хвилин
                <br />✔ У групі 6-8 осіб
              </>
            }
            order={2}
          />
            <a href="https://forms.gle/uXhGv9GAiwkyjfBt7">
          <Button
            className="bg-amber-400 text-black hover:bg-amber-500 text-xl mt-7 rounded-lg px-12 py-6"
            variant={"secondary"}
          >
            Записатись на курс
          </Button>
          </a>
        </div>
        <div className="bg-white w-full pb-24 pt-12">
          <div className="container mx-auto my-32 px-4 sm:px-6  text-center">
            <Title
              title="Тарифи"
              subtitle="Залежать від кількості обраних занять"
            />
            <div className="grid grid-cols-1 lg:grid-cols-3 gap-10 lg:divide-x-2">
              <TariffListItem
                numListItem={1}
                text={
                  <>
                    <strong>Оплата за 8 занять.</strong>
                    <br />в групі від 6-8 учнів <br />
                    регулярні турніри
                    <br />
                    враховано знижку -5%
                    <br />
                    <span className="line-through"> 2400 грн</span> -{" "}
                    <strong>2280 грн.</strong>
                  </>
                }
              />
              <TariffListItem
                numListItem={2}
                text={
                  <>
                    <strong>Оплата за 18 занять.</strong>
                    <br />в групі від 6-8 учнів
                    <br />
                    регулярні турніри
                    <br />
                    враховано знижку -10%
                    <br />
                    <span className="line-through">5400 грн </span>-{" "}
                    <strong>4860 грн.</strong>
                  </>
                }
              />
              <TariffListItem
                numListItem={3}
                text={
                  <>
                    <strong>Оплата за 36 занять.</strong>
                    <br />в групі від 6-8 учнів
                    <br />
                    регулярні турніри
                    <br />
                    враховано знижку -16%
                    <br />
                    <span className="line-through">10 800 грн </span>-{" "}
                    <strong>9100 грн.</strong>
                  </>
                }
              />
              <div id="program"></div>
            </div>
          </div>
        </div>
        <div className="container mx-auto my-32 px-4 sm:px-6  text-center" >
          <Title
            title='Програма навчання в онлайн-школі "King&Queen" '
            subtitle="Розроблена для максимально ефективного засвоєння матеріалу, навчання, що мотивує"
          />
          <div className="text-start xl:px-52">
            <ReusableAccordion
              title="Курс &quot;Початківці&quot;"
              text={
                <>
                  <div>
                    <strong>
                      <em>
                        Прищеплюємо інтерес до гри, знайомимося з правилами
                        шахів, вивчаємо ходи фігур
                      </em>
                    </strong>
                    <br />
                    <strong>
                      <em>
                        Практичні завдання та вирішення завдань на кожному
                        занятті, зворотний зв&apos;язок з тренером-викладачем за
                        результатами роботи
                      </em>
                    </strong>
                    <br />
                    <br />
                    <p>
                      1. Виникнення шахів. Коротка історія розвитку гри. Шахова
                      дошка, фігури, розташування фігур. Огляд та робота на
                      платформі Lichess
                    </p>
                    <p>2. Тура. Хід, взяття. Дидактичні практичні ігри.</p>
                    <p>3. Слон. Тура проти слона.</p>
                    <p>4. Ферзь. Ферзь проти тури, слона.</p>
                    <p>5. Найхитріша шахова фігура – кінь.</p>
                    <p>
                      6. Пішак. Особливі шахові ходи – перетворення, взяття на
                      проході.
                    </p>
                    <p>7. Напад та захист. Цінність фігур. Вигідний обмін.</p>
                    <p>8. Найважливіша шахова фігура – король.</p>
                    <p>9. Шах та способи захисту від шаха.</p>
                    <p>10. Мат. Створення небезпеки мату. Захист від мату.</p>
                    <p>11. Нічия у шахах.</p>
                    <p>12. Правила виконання рокірування.</p>
                    <p>13. Лінійний мат. Розігрування навчальних позицій.</p>
                    <p>
                      14. Мат королем та ферзем. Розв&apos;язання задач «Мат у 1, 2
                      ходи».
                    </p>
                    <p>
                      15. Мат королем та турою. Розв&apos;язання задач «Мат у 1, 2
                      ходи».
                    </p>
                    <p>
                      16. Типові матові ідеї. Мат у дебюті, міттельшпилі,
                      ендшпілі.
                    </p>
                    <strong>Результат курсу:</strong>
                    <br />
                    <ul>
                      <li>
                        Дитина опанує ходи всіх фігур, дізнається, що таке
                        «взяття на проході» та «рокірування», навчиться ставити
                        лінійний та дитячий мат, познайомиться з типовими
                        матовими позиціями.
                      </li>
                    </ul>
                  </div>
                </>
              }
            />
            <ReusableAccordion
              title="Курс &quot;Джуніори&quot;"
              text={
                <>
                  <div>
                    <strong>
                      <em>
                        Практичні завдання та вирішення завдань на кожному
                        занятті, зворотний зв&apos;язок з тренером-викладачем за
                        результатами роботи
                      </em>
                    </strong>
                    <br />
                    <br />
                    <p>
                      1. Особливі шахові ходи: взяття на проході, перетворення
                      пішаків, правила виконання рокірування.
                    </p>
                    <p>2. Шах, мат, пат. Нічиї в шахах. Прості мати.</p>
                    <p>3. Лінійний мат. Розігрування навчальних позицій.</p>
                    <p>4. Мат королем та ферзем. План мату.</p>
                    <p>
                      5. Мат королем та турою. Розв&apos;язання задач «Мат у 1, 2
                      ходи».
                    </p>
                    <p>
                      6. Різні види матів: батарейний, арабський, спертий, мат
                      по крайній лінії (їх 4).
                    </p>
                    <p>
                      7. Дебют – початок партії. Типові дебютні помилки. Як
                      поставити мат за 2,3,4 ходу.
                    </p>
                    <p>8. Як розпочинати партію: основні дебютні правила.</p>
                    <strong>Результат курсу:</strong>
                    <br />
                    <ul>
                      <li>
                        Курс для дітей, які знають початкові правила шахів, але
                        які ще не володіють потрібним набором знань для складних
                        шахових варіацій розвитку партії. У цьому курсі учні
                        засвоять базові прийоми пішки та тури ендшпіля. На
                        заняттях курсу також розберемо основні прийоми та методи
                        атаки на короля, познайомимося з типовими комбінаціями
                        на позицію рокірування
                      </li>
                    </ul>
                  </div>
                </>
              }
            />
            <ReusableAccordion
              title="Курс &quot;Мідли&quot;"
              text={
                <>
                  <div>
                    <strong>
                      <em>
                        Практичні завдання та вирішення завдань на кожному
                        занятті, зворотний зв&apos;язок з тренером-викладачем за
                        результатами роботи
                      </em>
                    </strong>
                    <br />
                    <strong>Розділ «Вивчення тактичних прийомів»:</strong>
                    <br />
                    <p>1. Подвійний удар. Вирішення задач.</p>
                    <p>
                      2. Виделка. Вивчення навчальних партій на тему &quot;Подвійний
                      удар&quot;.
                    </p>
                    <p>3. Лінійний удар - &quot;спис&quot;.</p>
                    <p>4. Зв&apos;язування. Використання зв&apos;язки для мату короля.</p>
                    <p>
                      5. Зв&apos;язування. Використання зв&apos;язки для взяття фігур.
                    </p>
                    <p>6. Піймання фігур.</p>
                    <p>7. Розкритий та подвійний шах. &quot;Млин&quot;.</p>
                    <p>8. Розкритий напад.</p>
                    <p>9. Мат у 2-3 ходи. Типові комбінації.</p>
                    <p>10. Знищення захисту.</p>
                    <p>11. Відволікання. Слабкість останньої горизонталі.</p>
                    <p>12. Залучення, блокування.</p>
                    <p>13. Перекриття, проміжний хід.</p>
                    <p>14. Визволення поля, лінії.</p>
                    <strong>Розділ «Вивчення дебюту – початку партії»:</strong>
                    <br />
                    <p>1. Основні засади гри у дебюті. Значення центру.</p>
                    <p>2. Найшвидший розвиток фігур.</p>
                    <p>3. Безпека короля на початку партії.</p>
                    <p>4. Порушення дебютних принципів.</p>
                    <p>5. Типові помилки шахістів-початківців.</p>
                    <p>6. Відкриті дебюти за білих.</p>
                    <p>7. Дебюти для шахістів-початківців за чорних.</p>
                    <p>
                      8. Активність фігур. Реалізація кількісної переваги у
                      фігурах.
                    </p>
                    <p>9. Перехід у ендшпіль.</p>
                    <p>
                      10. Вивчення алгоритму та розвитку, правильне виведення
                      шахових фігур.
                    </p>
                    <strong>Результат курсу:</strong>
                    <br />
                    <ul>
                      <li>
                        У процесі курсу учні вивчають базові тактичні прийоми:
                        зв&apos;язування, подвійний удар, розкритий напад,
                        відволікання, залучення, знищення захисту. У першій
                        частині курсу вчимося вирішувати багатофігурні завдання
                        на мат у 2-3 ходи, знайомимося з типовими шаховими
                        комбінаціями. Друга частина курсу присвячена вивченню
                        дебюту, освоять основні правила гри на початку партії,
                        початкову теорію дебютів, розберуть типові дебютні
                        помилки.
                      </li>
                    </ul>
                  </div>
                </>
              }
            />
            <ReusableAccordion
              title="Курс &quot;Сеньйори&quot;"
              text={
                <>
                  <div>
                    <strong>
                      <em>
                        Після кожного заняття самостійна робота, розігрування
                        навчальних позицій, зворотний зв&apos;язок із 
                      </em>
                    </strong>{" "}
                    <strong>
                      <em>тренером-викладачем</em>
                    </strong>{" "}
                    <strong>
                      <em>за результатами роботи</em>
                    </strong>
                    <br />
                    <br />
                    <strong>Основи пішакового ендшпілю:</strong>
                    <br />
                    <br />
                    <p>
                      1. Основні засади гри в ендшпілі. Аналіз партій із
                      творчості учнів з погляду ендшпіля.
                    </p>
                    <p>2. Основи пішакового ендшпілю. Прохідні пішаки.</p>
                    <p>3. Правило квадрата.</p>
                    <p>
                      4. Проведення пішака у ферзі. Протистояння . Захист від
                      проведення пішака.
                    </p>
                    <p>5. Король і крайній пішак.</p>
                    <p>6. Ферзь проти пішака на другій горизонталі.</p>
                    <p>7. Повчальні ендшпильні помилки.</p>
                    <br />
                    <strong>Атака на короля:</strong>
                    <br />
                    <p>1. Активність у шахах. Взаємодія фігур в атаці.</p>
                    <p>
                      2. Основні засади атаки на короля. Атака на короля у
                      центрі.
                    </p>
                    <p>
                      3. Атака на короля у центрі. Аналіз партій чемпіонів
                      світу.
                    </p>
                    <p>
                      4. Атака на позицію короткого рокірування. Типові
                      комбінації.
                    </p>
                    <p>
                      5. Атака на позицію довгого рокірування. Фігурно-пішкова
                      атака.
                    </p>
                    <p>6. Атака при різнобічних рокіровках. пішакові штурми.</p>
                    <p>7. Типові помилки під час атаки короля.</p>
                    <br />
                    <strong>Пішаковий ендшпіль. Типові прийоми:</strong>
                    <br />
                    <p>1. Віддалена прохідна.</p>
                    <p>2. Захищена прохідна.</p>
                    <p>3. Прорив.</p>
                    <p>
                      4. Трикутник, відштовхування плечем, поля відповідності.
                    </p>
                    <p>5. Розбір зіграних.</p>
                    <br />
                    <strong>Основи стратегії:</strong>
                    <br />
                    <p>1. Хороші та погані фігури. Помилки під час обміну.</p>
                    <p>2. Перевага двох слонів.</p>
                    <p>3. Слабкі та сильні поля.</p>
                    <p>4. Пішакова структура. «Слабкі» пішаки.</p>
                    <p>5. Відкриті лінії. Вторгнення по відкритій лінії.</p>
                    <p>6. Відкриті лінії – використання форпосту.</p>
                    <p>7. Атака на ферзовому фланзі.</p>
                    <p>
                      8. Базові позиції тури в ендшпілі. Тура проти пішака та
                      пішаків.
                    </p>
                    <p>
                      9. Позиція Лусен- позиція в ендшпілі «тури з пішаком проти
                      тури». Побудова мосту.
                    </p>
                    <p>
                      10. Позиція Філідора- типова нічийна позиція в ендшпілі
                      «тури з пішаком проти тури».
                    </p>
                    <p>11. Реалізація переваги в тури в ендшпілі.</p>
                    <br />
                    <strong>Результат курсу:</strong>
                    <br />
                    <ul>
                      <li>
                        Курс для дітей, які вміють вирішувати завдання на мат у
                        3-4 ходи, знають принципи розігрування дебюту та основні
                        дебютні системи. В ендшпільній частині курсу учні
                        освоять базові прийоми пішакового та тури в ендшпіля. На
                        заняттях курсу також розберемо основні прийоми та методи
                        атаки на короля, познайомимося з типовими комбінаціями
                        на позицію рокірування. На прикладах партій чемпіонів
                        світу та видатних шахістів проаналізуємо основні
                        стратегічні елементи позиції та їх використання.
                      </li>
                    </ul>
                  </div>
                </>
              }
            />
          </div>
        </div>
        <div className="w-full bg-white py-12" id="schedule">
          <div className="container mx-auto my-32 px-4 sm:px-6 md:px-12 lg:px-52  text-center">
            <Title title="Розклад занять" subtitle="" />
            <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-10 mt-12">
              <TimeCard
                day="Понеділок"
                text={
                  <>
                    17:00–18:00 Група &quot;Початківці&quot;
                    <br />
                    18:10-19:10 Група &quot;Джуніори&quot;
                    <br />
                    19:20-20:20 Група &quot;Мідли&quot;
                  </>
                }
              />
              <TimeCard
                day="Вівторок"
                text={
                  <>
                    17:00–18:00 Група &quot;Початківці&quot;
                    <br />
                    18:10-19:10 Група &quot;Джуніори&quot;
                    <br />
                    19:20-20:20 Група &quot;Мідли&quot;
                  </>
                }
              />
              <TimeCard
                day="Середа"
                text={
                  <>
                    17:00–18:00 Група &quot;Початківці&quot;
                    <br />
                    18:10-19:10 Група &quot;Джуніори&quot;
                    <br />
                    19:20-20:20 Група &quot;Сеньйори&quot;
                  </>
                }
              />
              <TimeCard
                day="Четвер"
                text={
                  <>
                    17:00–18:00 Група &quot;Початківці&quot;
                    <br />
                    18:10-19:10 Група &quot;Джуніори&quot;
                    <br />
                    19:20-20:20 Група &quot;Мідли&quot;
                  </>
                }
              />
              <TimeCard
                day="П'ятниця"
                text={
                  <>
                    17:00–18:00 Група &quot;Початківці&quot;
                    <br />
                    18:10-19:10 Група &quot;Початківці&quot;
                    <br />
                    19:20-20:20 Група &quot;Джуніори&quot;
                  </>
                }
              />
              <TimeCard
                day="Субота"
                text={
                  <>
                    14:00-15:00 Група &quot;Початківці&quot;
                    <br />
                    15:10-16:10 Група &quot;Джуніори&quot;
                    <br />
                    16:20-17:20 Група &quot;Мідли&quot;
                    <br />
                    17:30-18:30 Група &quot;Сеньйори&quot;
                  </>
                }
              />
              <TimeCard
                day="Неділя"
                text={
                  <>
                    12:00-13:00 Група &quot;Початківці&quot;
                    <br />
                    13:20-14:20 Група &quot;Джуніори&quot;
                  </>
                }
              />
            </div>
          </div>
        </div>
        <div className="w-full">
          <div className="relative p-32">
            <Image
              src={bgImg}
              alt="tariff1"
              layout="fill"
              objectFit="cover"
              className="z-0"
            />
            <div className="absolute inset-0 bg-black opacity-50"></div>
            <div className="relative z-10 flex flex-col items-center justify-center h-full text-white">
              <Title
                title="Готові почати систематичне навчання, яке дійсно працює?"
                subtitle="Ви можете перевірити це прямо зараз!"
              />
              <a href="https://forms.gle/uXhGv9GAiwkyjfBt7">
              <Button className="bg-amber-400 text-black hover:bg-amber-500 text-xl mt-7 rounded-lg px-12 py-6">
                Заповнити анкету
              </Button>
              </a>
            </div>
          </div>
        </div>
      </>
    );
}
